SeniorDesignTeamOmicron/SparkFun-nRF52-Embedded-App/LogiSteps/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>


#include "nordic_common.h"
#include "nrf.h"
#include "ble_advdata.h"
#include "app_error.h"
#include "app_timer.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"


#include "our_ble.h"
#include "our_saadc.h"

//TESTING
#include "nrf_gpio.h"
#include "nrf_delay.h"


#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


// Declare a service structure
ble_os_t m_our_service;


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
void timers_init(void) {
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
 */
void application_timers_start(void) {
    
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
void sleep_mode_enter(void) {
    ret_code_t err_code;

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
void log_init(void) {
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
void power_management_init(void) {
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
void idle_state_handle(void) {
    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for application main entry.
 */
int main(void) {
    bool erase_bonds;

    // general inits
    log_init();
    power_management_init();
    application_timers_start();
    timers_init();


    // ble inits
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();


    // saadc inits
    //lfclk_config();
    saadc_init();
    saadc_sampling_event_init();


    // Start execution.
    //NRF_LOG_INFO("LogiSteps started.");
    advertising_start(erase_bonds);
    saadc_sampling_event_enable();


    // testing
    nrf_gpio_cfg_output(7);
    nrf_gpio_pin_clear(7);
    //nrf_delay_ms(10000);
    //nrf_gpio_pin_toggle(7);

    
    // Enter main loop.
    for (;;) {
        //NRF_LOG_INFO("Starting WFE/pwrmngmt.");
        //__WFE();
        nrf_pwr_mgmt_run();
        //NRF_LOG_INFO("Left WFE/pwrmngmt.");

        //NRF_LOG_INFO("Entering 'sleep' mode.");   //sleep = off mode
        //sleep_mode_enter();

        //sd_app_evt_wait();
        //idle_state_handle();
    }
}